app/controllers/artists_controller.rb

    def create
        @new_artist = Artist.new(artist_params)
        @new_artist.save
---
INSERT INTO "artists" ("name", "photo_url", "nationality", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"

    def edit
        @artist = Artist.find(params[:id])
---
SELECT  "artists".* FROM "artists" WHERE "artists"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]

    def update
        @artist = Artist.find(params[:id])
        @artist.update(artist_params)
---
SELECT  "artists".* FROM "artists" WHERE "artists"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
UPDATE "artists" SET "name" = $1, "updated_at" = $2 WHERE "artists"."id" = $3  [["name", "Yeah Yeah Yeahs aflkdjakdfafd"], ["updated_at", "2017-10-27 18:24:19.644527"], ["id", 1]]